app/controllers/notes_controller.rb

INSERT INTO "notes" ("created_at", "text", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-01-03 18:22:04.072390"], ["text", "A test note!"], ["updated_at", "2015-01-03 18:22:04.072390"]]
---
  def create
    begin
      @note = Note.new(note_params)
      if @note.save